# Напишите функцию summa_n,
# которая принимает одно целое положительное число N
# и выводит сумму всех чисел от 1 до N включительно.
#
# Пример работы программы:
# Введите число: 5
#
# Я знаю, что сумма чисел от 1 до 5 равна 15
def summa_n(N):
    summ = 0
    for x in range(N + 1):
        summ += x
    return summ


N = int(input("Введите число: "))
print(f"Я знаю, что сумма чисел от 1 до {N} равна {summa_n(N)}")
