# Вы пришли на работу в контору по разработке игр,
# целевая аудитория которых - дети и их родители.
#
# У прошлого программиста было задание
# сделать две игры в одном приложении, чтобы пользователь мог выбирать одну из них.
#
# Однако программист, на место которого вы пришл
# и, перед увольнением не успел сделать эту задачу и оставил только небольшой шаблон проекта.
#
# Используя этот шаблон,
# реализуйте игры «Камень, ножницы, бумага» и «Угадай число».
#
# Правила игры «Камень, ножницы, бумага»:
# программа запрашивает у пользователя строку
# и выводит победил он или проиграл.
#
# Камень бьёт ножницы, ножницы режут бумагу, бумага кроет камень.
#
# Правила игры “Угадай число”:
# программа запрашивает у пользователя число до тех пор, пока он его не отгадает.

import random


def rock_paper_scissors():
    comp = random.SystemRandom().choice(['камень', 'ножницы', 'бумага'])
    user = input('Введите камень, ножницы или бумага: ')
    if user == 'камень' and comp == 'ножницы':
        print(f'Компютер выбрал: {comp}')
        print('Вы победили')
    elif user == 'камень' and comp == 'бумага':
        print(f'Компютер выбрал: {comp}')
        print('Вы проиграли')
    elif user == 'ножницы' and comp == 'камень':
        print(f'Компютер выбрал: {comp}')
        print('Вы проиграли')
    elif user == 'ножницы' and comp == ',бумага':
        print(f'Компютер выбрал: {comp}')
        print('Вы выйграли')
    elif user == 'бумага' and comp == 'ножницы':
        print(f'Компютер выбрал: {comp}')
        print('Вы проиграли')
    elif user == 'бумага' and comp == 'камень':
        print(f'Компютер выбрал: {comp}')
        print('Вы выйрали')
    else:
        print(f'Компютер выбрал: {comp}')
        print('Ничья')


def guess_the_number():
    comp = random.randint(1, 10)
    while True:
        user = int(input("Угадайте число, которое загадал компьютер(От 1 до 10): "))
        if user != comp:
            print("Вы не угадали, попробуйте еще раз.")
        else:
            print(f"Поздравляем! Вы назвали число {user}, а компьютер загадал число {comp}.")
            break


def mainMenu():
    choice = int(input('Выберите игру:\n1) Камень.Ножницы.Бумага.\n2) Угадай число.\nВаш выбор: '))
    if choice == 1:
        print()
        rock_paper_scissors()
    elif choice == 2:
        print()
        guess_the_number()
    else:
        print('Неправильный выбор. Выберите игру.')


mainMenu()
