# Пользователь вводит два числа — N и K.
# Напишите программу,
# которая заменяет каждое число на число,
# которое получается из исходного записью его цифр в обратном порядке,
# затем складывает их,
# снова переворачивает и выводит ответ на экран.

# Пример:

# Введите первое число: 102
# Введите второе число: 123


# Первое число наоборот: 201
# Второе число наоборот: 321

# Сумма: 522
# Сумма наоборот: 225

def f(x):
    a = 0
    while x > 0:
        a = a * 10 + x % 10
        x = x // 10
    return a


n = int(input('Введите первое число: '))
k = int(input('Введите второе число: '))
print('Первое число наоборот:', f(n))
print('Второе число наоборот:', f(k))
print('Сумма:', f(n) + f(k))
print('Сумма наоборот:', f(f(n) + f(k)))
