# Реализуйте программу,
# которая запрашивает два числа у пользователя.
# После этого у каждого числа возьмите две последние цифры.
# Получившиеся два числа сложите и выведите на экран.

# Пример:
# Введите первое число: 456
# Введите второе число: 123
# Сумма: 79

first_users_number = int(input("Введите первое число: "))
second_users_number = int(input("Введите второе число: "))
res = first_users_number % 100 + second_users_number % 100
print("Сумма:", res)
