# Напишите программу,
# которая получает на вход число n — количество минут, — затем считает,
# 1) сколько это будет в часах
# 2) сколько минут останется
# и выводит на экран эти два результата.
# (В вычислениях вам помогут операции // и %)

received_minutes = int(input("Введите кол-во минут: "))
hours_count = received_minutes // 60
remains_minutes = received_minutes % 60
print("Кол-во целых часов:", hours_count)
print("Кол-во оставшихся минут:", remains_minutes)
