# Васе пришло очередное задание — автоматизация финансовой отчётности.
# Звучит сложно, а на деле нужно просто написать код, который будет считать нужные для отчёта вычисления автоматически.
# Вычисления, которые нужно реализовать в программе: сумму дохода первых двух кварталов поделить на сумму последних двух кварталов,
# чтобы понять динамику роста или падения дохода.

# Алгоритм действий в программе:
# 1) Запросить у пользователя четыре числа.
# 2) Отдельно сложить два первых и два вторых.
# 3) Разделить первую сумму на вторую.
# 4) Вывести результат на экран.

first_quarter = int(input("Введите сумму дохода за первый квартал: "))
second_quarter = int(input("Введите сумму дохода за второй квартал: "))
third_quarter = int(input("Введите сумму дохода за третий квартал: "))
fourth_quarter = int(input("Введите сумму дохода за четвертый квартал: "))
sum_first_quarters = first_quarter + second_quarter
sum_second_quarters = third_quarter + fourth_quarter
res = sum_first_quarters / sum_second_quarters
print(res)
