# Старому капитану нужно пополнить команду, но на корабль попадут только достойные! Он отобрал десять человек. Те,
# кто крикнет слово «Карамба», попадут на борт.

# Что нужно сделать

# Пользователь вводит десять слов. Напишите программу, которая определяет, сколько из них совпадают со словом «Карамба».
pirates = 0
for count in range(10):
    word = input("Хочешь на корабль? ")
    if word == "Карамба" or word == "карамба":
        pirates += 1
print(f"Мы набрали в команду {pirates} новых человека")
