# В классе N человек.
# Каждый из них получил за урок по информатике оценку: 3, 4 или 5, двоек сегодня не было.
#
# Напишите программу,
# которая получает список оценок - N чисел - и выводит на экран сообщение о том,
# кого сегодня больше: отличников, хорошистов или троечников.

# Замечание: можно предположить, что количество отличников, хорошистов, троечников различно.
troechnik = 0
horoshist = 0
gooder = 0
N = int(input("Введите кол-во чисел: "))
for i in range(N):
    estimation = int(input("Введите оценку: "))
    if estimation == 3:
        troechnik += 1
    elif estimation == 4:
        horoshist += 1
    else:
        gooder += 1
if troechnik > horoshist and troechnik > gooder:
    print("Больше троечников")
elif horoshist > gooder:
    print("Хорошистов больше")
else:
    print("больше всего отличников")
