# Степан использует калькулятор для расчёта суммы и разности чисел, но на работе ему требуются не только обычные
# арифметические действия. Он ничего не хочет делать вручную, поэтому решил немного расширить функционал калькулятора.

# Напишите программу, запрашивающую у пользователя число и действие, которое нужно сделать с числом: вывести сумму
# его цифр, максимальную или минимальную цифру.

# Каждое действие оформите в виде отдельной функции, а основную программу зациклите.

# Запрошенные числа должны передаваться в функции суммы, максимума и минимума при помощи аргументов.
def sum_of_digits(number):
    sum = 0

    while number > 0:
        digit = number % 10
        sum += digit
        number //= 10

    print("Сумма цифр числа:", sum)


def max_of_digits(number):
    max_digit = 0

    for x in str(number):
        if int(x) > max_digit:
            max_digit = int(x)
    print(f"Самая большая цифра числа это {max_digit}")


def min_of_digits(number):
    min_digit = 10

    for x in str(number):
        if int(x) < min_digit:
            min_digit = int(x)
    print(f"Самая маленькая цифра числа это {min_digit}")


N = int(input("Введите число (0 - Это выход): "))
while N != 0:
    action = int(input("Введите номер действия:\n1) Сумма цифр\n2) Максимальная из цифр\n3) Минимальная из цифр\n"))
    if action == 1:
        sum_of_digits(N)
    elif action == 2:
        max_of_digits(N)
    elif action == 3:
        min_of_digits(N)
    else:
        print("Неверное действие")
    N = int(input("Введите число (0 - Это выход): "))