# Напишите функцию, вычисляющую наибольший общий делитель двух чисел
def gcd(a, b):
    if b == 0:
        return a
    else:
        return gcd(b, a % b)


x1 = int(input("Введите первое число: "))
x2 = int(input("Введите второе число: "))
print(f"Наибольший общий делитель чисел это: {gcd(x1, x2)}")
