# Вклад в банке составляет X рублей.
# Ежегодно он увеличивается на P процентов,
# после чего дробная часть копеек отбрасывается.

# Определите, через сколько лет вклад составит не менее Y рублей.

# Напишите программу,
# которая по данным числам X, Y, P определяет,
# сколько лет пройдёт, прежде чем сумма достигнет значения Y.

X = int(input("Введите величину вклада: "))
P = int(input("Введите процентную ставку: "))
Y = int(input("Какую сумма необходима? "))
years = 0
while X < Y:
    X += X * (P / 100)
    years += 1
    X //= 1
print(years, " лет понадобится")
