# Напишите программу,
# которая рисует с помощью символьной графики прямоугольную рамку.
# Для вертикальных линий используйте символ вертикального штриха “|”,
# а для горизонтальных - дефис “-”. Пусть пользователь вводит ширину и высоту рамки.

#  _ _ _ _ _ _ _ _ _
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |_ _ _ _ _ _ _ _ _|
width = int(input("Введите ширину рамки: "))
height = int(input("Введите высоту рамки: "))
print(" -" * width + " -")
for y in range(height):
    print("|" + " " * (2 * width + 1) + "|")
print(" -" * width + " -")
