# Напишите программу, которая считает количество простых чисел в заданной последовательности и выводит ответ на экран.

# Простое число делится только на себя и на единицу. Последовательность задаётся при помощи вызова ввода (input) на
# каждой итерации цикла. Одна итерация — одно число.

# Пример:
# Введите количество чисел: 6.
# Введите число: 4.
# Введите число: 7.
# Введите число: 20.
# Введите число: 3.
# Введите число: 11.
# Введите число: 37.

# Количество простых чисел в последовательности: 4.
N = int(input("Введите количество чисел: "))
count = 0
for counter in range(N):
    number = int(input("Введите число: "))
    divide_count = 0
    for divider in range(2, number // 2 + 1):
        if number % divider == 0:
            divide_count += 1
    if divide_count <= 0:
        count += 1
print(f"Количество простых чисел в последовательности: {count}")
