# Представьте, что вы разрабатываете компьютерную игру с текстовой графикой. Вам поручили создать генератор ландшафта. Напишите программу, которая получает на вход число N и выводит на экран числа в виде ямы:

# Напишите программу,
# которая получает на вход число N и выводит на экран числа в виде “ямы”:

# Введите число: 5
#
# 5........5
# 54......45
# 543....345
# 5432..2345
# 5432112345

N = int(input("Введите число: "))
max_str = ""
for y in range(N, 0, -1):
    max_str += str(y)
max_lenght = len(max_str)

for y in range(1, N + 1):
    line = ""
    for x in range(N, N - y, -1):
        line += str(x)
    line += "." * (max_lenght - len(line))
    print(line + line[::-1])
